szevczenko/hq_led_lamp/sdkconfig.defaults.esp32c6
# ESP32-C6 placeholder board profile — not production-ready.
# Build with: idf.py -DIDF_TARGET=esp32c6 build
# Pin assignments and flash size must be confirmed before this profile
# is used in production. No credentials or secrets are stored here.
CONFIG_IDF_TARGET="esp32c6"
CONFIG_KLC_BOARD_ESP32_C6=y
CONFIG_KLC_LED_PWM_GPIO=18
# ESP HAL PWM backend runs LEDC at a fixed 13-bit resolution:
# 8000 * 2^13 = 65 536 000 < 80 000 000 (APB clock)
CONFIG_KLC_LED_PWM_FREQUENCY_HZ=8000
# Must match the HAL backend's fixed 13-bit resolution
CONFIG_KLC_LED_PWM_RESOLUTION_BITS=13
CONFIG_KLC_LED_PWM_ACTIVE_LOW=n
CONFIG_KLC_DEFAULT_BRIGHTNESS_PERCENT=100
CONFIG_KLC_THINGSBOARD_SYNC_TIMEOUT_MS=10000
CONFIG_KLC_TELEMETRY_PERIOD_MS=30000

# Wi-Fi HTTP provisioning (TASK-131): mirror the base sdkconfig.defaults so
# C6 support needs no product-domain changes — the platform automatic
# fallback controller is compiled in with a bounded CONNECT_FAILED budget,
# and the platform success-grace knob is the single grace source of truth.
CONFIG_WIFI_HTTP_PROVISIONING=y
CONFIG_WIFI_HTTP_PROVISIONING_AUTO_FALLBACK=y
CONFIG_WIFI_HTTP_PROVISIONING_FALLBACK_ATTEMPTS=2
CONFIG_WIFI_HTTP_PROVISIONING_SUCCESS_GRACE_MS=2000
